// ConsoleApplication1.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <stdio.h>
#include <windows.h>

int main()
{
	/************************************************************************/
	/* 布尔值 bool为布尔型，取值false和true,1字节，是0和1的区别*/
	/************************************************************************/    
	bool flag = true;
	if (flag) {}
	if(!flag){}

	/************************************************************************/
	/* 整型 BOOL为int型，取值FALSE和TRUE，一般4字节，是0和非0的区别                                                                     */
	/************************************************************************/
	BOOL bFlag = TRUE;
	if(bFlag == TRUE){}
	if(bFlag == FALSE){}

	/************************************************************************/
	/* 浮点变量 
	无论float还是double类型的变量，都有精度限制，所以一定要避免将浮点变量用
	"=="或"!="直接与数字做比较，应该设法转化成">="或"<="的形式*/
	/************************************************************************/
	//假设浮点变量的名字为x，应当将
	float x = 0.0;
	const float EPSINON = 0.00001;
	if (x == 0.0) {} // 隐含错误的比较
	//转化为
	if ((x >= -EPSINON) && (x <= EPSINON)){}
	//其中EPSINON是允许的误差（即精度）。

	/************************************************************************/
	/* 指针变量 p 与 0 的比较
	指针变量的零值是空(记为NULL)，NULL与0值相同，意义不同，
	用p与NULL显式比较，强调p是指针变量*/
	/************************************************************************/
	char* p = NULL;
	if (p == NULL) {}
	if (p != NULL) {}
}
